# Import library

In [102]:
import pandas as pd

In [103]:
import numpy as np

# importing data

In [104]:
Order_Report= pd.read_excel(r'C:\Users\pc\Desktop\Company X - Order Report.xlsx')
Pincode_Zones= pd.read_excel(r'C:\Users\pc\Desktop\Company X - Pincode Zones.xlsx')
SKU_Master= pd.read_excel(r'C:\Users\pc\Desktop\Company X - SKU Master.xlsx')
Invoice= pd.read_excel(r'C:\Users\pc\Desktop\Courier Company - Invoice.xlsx')
Rates= pd.read_excel(r'C:\Users\pc\Desktop\Courier Company - Rates.xlsx')

In [105]:
Order_Report.head()

   ExternOrderNo            SKU  Order Qty
0     2001827036  8904223818706        1.0
1     2001827036  8904223819093        1.0
2     2001827036  8904223819109        1.0
3     2001827036  8904223818430        1.0
4     2001827036  8904223819277        1.0

In [106]:
Pincode_Zones.head()

   Warehouse Pincode  Customer Pincode Zone
0             121003            507101    d
1             121003            486886    d
2             121003            532484    d
3             121003            143001    b
4             121003            515591    d

In [107]:
SKU_Master.head()

             SKU  Weight (g)
0  8904223815682         210
1  8904223815859         165
2  8904223815866         113
3  8904223815873          65
4  8904223816214         120

In [108]:
Invoice.head()

,AWB Code,Order ID,Charged Weight,Warehouse Pincode,Customer Pincode,Zone,Type of Shipment,Billing Amount (Rs.)
0,1091117222124,2001806232,1.30,121003,507101,d,Forward charges,135.0
1,1091117222194,2001806273,1.00,121003,486886,d,Forward charges,90.2
2,1091117222931,2001806408,2.50,121003,532484,d,Forward charges,224.6
3,1091117223244,2001806458,1.00,121003,143001,b,Forward charges,61.3
4,1091117229345,2001807012,0.15,121003,515591,d,Forward charges,45.4

In [109]:
Rates.head()

,Zone,Weight Slabs,Forward Fixed Charge,Forward Additional Weight Slab Charge,RTO Fixed Charge,RTO Additional Weight Slab Charge
0,A,0.50,29.5,23.6,13.6,23.6
1,B,1.00,33.0,28.3,20.5,28.3
2,C,1.25,40.1,38.9,31.9,38.9
3,D,1.50,45.4,44.8,41.3,44.8
4,E,2.00,56.6,55.5,50.7,55.5

In [110]:
Order_Report.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   ExternOrderNo  400 non-null    int64
 1   SKU            400 non-null    object
 2   Order Qty      400 non-null    float64
dtypes: float64(1), int64(1), object(1)
memory usage: 9.5+ KB

In [111]:
Pincode_Zones.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 124 entries, 0 to 123
Data columns (total 3 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Warehouse Pincode  124 non-null    int64
 1   Customer Pincode   124 non-null    int64
 2   Zone               124 non-null    object
dtypes: int64(2), object(1)
memory usage: 3.0+ KB

In [112]:
SKU_Master.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 66 entries, 0 to 65
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   SKU         66 non-null     object
 1   Weight (g)  66 non-null     int64
dtypes: int64(1), object(1)
memory usage: 1.2+ KB

In [113]:
Invoice.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 124 entries, 0 to 123
Data columns (total 8 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   AWB Code              124 non-null    int64
 1   Order ID              124 non-null    int64
 2   Charged Weight        124 non-null    float64
 3   Warehouse Pincode     124 non-null    int64
 4   Customer Pincode      124 non-null    int64
 5   Zone                  124 non-null    object
 6   Type of Shipment      124 non-null    object
 7   Billing Amount (Rs.)  124 non-null    float64
dtypes: float64(2), int64(4), object(2)
memory usage: 7.9+ KB

In [114]:
Rates.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column                                 Non-Null Count  Dtype
---  ------                                 --------------  -----
 0   Zone                                   5 non-null      object
 1   Weight Slabs                           5 non-null      float64
 2   Forward Fixed Charge                   5 non-null      float64
 3   Forward Additional Weight Slab Charge  5 non-null      float64
 4   RTO Fixed Charge                       5 non-null      float64
 5   RTO Additional Weight Slab Charge      5 non-null      float64
dtypes: float64(5), object(1)
memory usage: 368.0+ bytes

In [115]:
#taking order id and AWS number 
order_id= Invoice[['Order ID']]
AWB_Number= Invoice[['AWB Code']]

# Claculations

In [116]:
Total_weight_x=SKU_Master['Weight (g)']/1000
Total_weight_CourierCompany=Invoice['Charged Weight']/1000

In [117]:
Weight_slab_X =Total_weight_x/2.5
Weight_slab_CourierCompany = Total_weight_CourierCompany/2.5

In [118]:
Delivery_Zone_per_X =Invoice[['Zone']]
Delivery_Zone_charged_by_Courier_Company=Invoice[['Charged Weight']]

In [119]:
# Assuming Rs. 500 per KG
Expected_Charge_as_per_X = Total_weight_x*Invoice['Charged Weight']*500

In [120]:
Charges_Billed_by_Courier_Company =Invoice[['Billing Amount (Rs.)']]

# generating new columns as per requrements

In [121]:
Order_Report['order_id']=order_id
Order_Report['AWB_Number']=AWB_Number
Order_Report['Total_weight_x']=Total_weight_x
Order_Report['Total_weight_CourierCompany']=Total_weight_CourierCompany
Order_Report['Weight_slab_X']=Weight_slab_X
Order_Report['Weight_slab_CourierCompany']=Weight_slab_CourierCompany
Order_Report['Delivery_Zone_per_X']=Delivery_Zone_per_X
Order_Report['Delivery_Zone_charged_by_Courier_Company']=Delivery_Zone_charged_by_Courier_Company
Order_Report['Expected_Charge_as_per_X']=Expected_Charge_as_per_X
Order_Report['Charges_Billed_by_Courier_Company']=Charges_Billed_by_Courier_Company

In [122]:
# Save the updated DataFrames back to Excel files
Order_Report.to_excel('updated_website_order_report.xlsx', index=False)

In [126]:
#cleaning data and filling minsing values
df=pd.read_excel(r'C:\Users\pc\Desktop\updated_website_order_report.xlsx')
df.fillna(0, inplace=True)
df.to_excel('updated_final_order_report.xlsx', index=False)

# summary excel sheet

In [124]:
summary_table = pd.DataFrame(
    {'Count': [1000, 0, 0],
     'Amount (Rs.)': [0, 0, 0],
     'Total orders where X has been correctly charged': 1000,
     'Total orders where X has been overcharged': 0,
     'Total orders where X has been undercharged': 0}
)

# Create a new Excel file
summary_table.to_excel('summary_table.xlsx', index=False)